infolitzofficial/PetTapProject/nRF9160Master/src/main.c
	LOG_INF("Starting GNSS AWS sample");

	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		return err;
	}

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

		err = aws_iot_init(NULL, aws_iot_event_handler);
	if (err) {
		LOG_ERR("AWS IoT library could not be initialized, error: %d", err);
	}

	/** Subscribe to customizable non-shadow specific topics
	 *  to AWS IoT backend.
	 */
	err = app_topics_subscribe();
	if (err) {
		LOG_ERR("Adding application specific topics failed, error: %d", err);
	}


	err = lte_lc_init_and_connect_async(lte_handler);/*lte lc initialization*/
	if (err) {
		LOG_ERR("Modem could not be configured, error: %d", err);
		return 0;
	}

	err = modem_info_init();/**/
	if (err) {
		LOG_ERR("Failed initializing modem info module, error: %d", err);
	}
	k_work_init_delayable(&connect_work, connect_work_fn);
	


	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		return -1;
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		return -1;
	}

	k_work_schedule(&connect_work, K_NO_WAIT); /*Aws connect work shedule*/
	fix_timestamp = k_uptime_get();

	// err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);
	// if (err) {
	// 	LOG_ERR("Failed to deactivate LTE, error: %d", err);
	// 	return;
	// }

	while(1)
	{
		k_msleep(10);
	}

	return 0;
}

static void GpsTask()
{
	uint8_t cnt = 0;
	uint8_t count = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;
	_sGnssConfig sGnssConfig = {0};

	for (;;) {
		//NRFX_DELAY_US(2000000);
		(void)k_poll(events, 2, K_FOREVER);

		if (events[0].state == K_POLL_STATE_SEM_AVAILABLE &&
		    k_sem_take(events[0].sem, K_NO_WAIT) == 0) {
			/* New PVT data available */

			if (IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)) {
				/* TTFF test mode. */

				/* Calculate the time GNSS has been blocked by LTE. */
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					time_blocked++;
				}
			} else if (IS_ENABLED(CONFIG_GNSS_SAMPLE_NMEA_ONLY)) {
				/* NMEA-only output mode. */

				if (output_paused()) {
					goto handle_nmea;
				}

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					print_distance_from_reference(&last_pvt);
				}
			} else {
				/* PVT and NMEA output mode. */

				if (output_paused()) {
					goto handle_nmea;
				}

				printf("\033[1;1H");
				printf("\033[2J");
				print_satellite_stats(&last_pvt);

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					printf("GNSS operation blocked by lte\n");
				}
				if (last_pvt.flags &
				    NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME) {
					printf("Insufficient GNSS time windows\n");
				}
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT) {
					printf("Sleep period(s) between PVT notifications\n");
				}
			//	printf("-----------------------------------\n");
			//	printk("satelite flag %d\n",last_pvt.flags);
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					gnss_connected = true;
					
					fix_timestamp = k_uptime_get();
					printf("\n Valid GNSS\n\n\n");

					// err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_LTE);
					// if (err) {
					// LOG_ERR("Failed to activate LTE, error: %d", err);
					// return;
					// }
					// NRFX_DELAY_US(2000000);
					print_fix_data(&last_pvt);
					sGnssConfig.dLatitude = last_pvt.latitude;
					sGnssConfig.dLongitude = last_pvt.longitude;
					UpdateLocation(&sGnssConfig);
					SetLocationDataStatus(true);
					
					if(cloud_connected == true && gnss_connected == true)
					{
						shadow_update(&last_pvt);
					}
					print_distance_from_reference(&last_pvt);
				} else {
					//printk("satelite flag %d\n",last_pvt.flags);
					gnss_connected = false;
					SetLocationDataStatus(false);
					//printf("Seconds since last fix: %d\n",
					//       (uint32_t)((k_uptime_get() - fix_timestamp) / 1000));
						    
						   //print_fix_data(&last_pvt);
						  count++;
					if(cloud_connected == true && (count > post_counter) )
					{
						create_dummy_gnss(&last_pvt);
						shadow_update(&last_pvt);
						count = 0;
					}
					else{
						//printk("\ncloud not connected\n");
					}
					cnt++;
					//printf("Searching [%c]\n", update_indicator[cnt%4]);
				}

			//	printf("\nNMEA strings:\n\n");
			}
		}

		//SendData("AT\n\r");

handle_nmea:
		if (events[1].state == K_POLL_STATE_MSGQ_DATA_AVAILABLE &&
		    k_msgq_get(events[1].msgq, &nmea_data, K_NO_WAIT) == 0) {
			/* New NMEA data available */

			if (!output_paused()) {
			//	printf("%s", nmea_data->nmea_str);
			}
			k_free(nmea_data);
		}

		events[0].state = K_POLL_STATE_NOT_READY;
		events[1].state = K_POLL_STATE_NOT_READY;
		k_msleep(100);
	}
} 

static void SystemTask()
{
	while (1)
	{
		ProcessDeviceState();
		k_msleep(10);
	}
}